import numpy as np
import matplotlib.pyplot as plt

# 示例数据列表

A  =  [237959680.0, 238051228.0, 237987812.0, 237990708.0, 238079036.0, 237999396.0, 237999396.0, 238954080.0, 238365740.0, 238352708.0]
B  =  [141364216.0, 139276968.0, 141916672.0, 139300136.0, 138137392.0, 134029416.0, 131473696.0, 134909800.0, 137400360.0, 135848104.0]
C  =  [94236064.0, 112972988.0, 131490308.0, 134575996.0, 135272484.0, 133650724.0, 128526252.0, 112738708.0, 94826948.0, 92959259.0]
D  =  [238517508.0, 238898840.0, 237964664.0, 238327644.0, 237983020.0, 238823744.0, 237974332.0, 238931460.0, 238817068.0, 237365424.0]
E  =  [237644632.0, 238266592.0, 237725040.0, 237610648.0, 237590376.0, 237591824.0, 237604856.0, 237581436.0, 237647100.0, 237641056.0]
F  =  [134679920.0, 140328216.0, 124755212.0, 133420044.0, 133961596.0, 136359484.0, 130411100.0, 135699196.0, 136653428.0, 132082792.0]

# 创建一个包含 10 个子图的图像
fig, axs = plt.subplots(2, 5, figsize=(15, 6))

# 遍历数据列表中的每个数据，绘制矩阵图
for i, (a, b,c,d,e,f) in enumerate(zip(A, B,C,D,E,F)):
    row = i // 5
    col = i % 5

    # 创建一个 3x3 的矩阵，对角线元素为0，其他元素根据A[i]和B[i]确定
    matrix = np.array([[0, a, b], [c, 0, e], [d, f, 0]])

    # 绘制矩阵图
    im = axs[row, col].matshow(matrix, cmap='Blues')

    # 添加标题
    axs[row, col].set_title(f'Epoch {i+1}')

    # 添加坐标轴标签
    axs[row, col].set_xticks([0, 1, 2])
    axs[row, col].set_xticklabels(['106', '108', '112'])
    axs[row, col].set_yticks([0, 1, 2])
    axs[row, col].set_yticklabels(['106', '108', '112'])

    # 显示坐标轴
    axs[row, col].xaxis.set_ticks_position('bottom')
    axs[row, col].yaxis.set_ticks_position('left')

# 添加整体标题
plt.suptitle('Traffic Matrix for Each Epoch(x for sender, y for reciever)', fontsize=16)

plt.tight_layout()
plt.savefig("TM.png")
